Revit 2026 API

# TableViewUIUtils Class

---

This utility class contains members that involve the Revit UI and operate on schedule views or MEP electrical panel schedules.

SystemObject Autodesk.Revit.UITableViewUIUtils

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class TableViewUIUtils
```
```vb
Public NotInheritable Class TableViewUIUtils
```
```cpp
public ref class TableViewUIUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type TableViewUIUtils = class end
```

The TableViewUIUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TestCellAndPromptToEditTypeParameter | Prompts the end-user to control whether a type parameter contained in the specified table cell should be allowed edited. |

#### Reference

Autodesk.Revit.UI Namespace